<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>Downloads the latest version of Sportimization Tools (VideoCoach and VideoCanvas).</string>
		<key>Identifier</key>
		<string>com.github.moritz-Z.download.Sportimization</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Sportimization-Tools - VideoCoach</string>
			<key>USER_AGENT</key>
			<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML,
				like Gecko) Version/6.0.3 Safari/536.28.10</string>
			<key>STOP_PREDICATE</key>
			<string>TRUEPREDICATE</string>
			<!-- <string>FALSEPREDICATE</string> -->
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>
						(?&lt;=https://www.sportimization.com/files/videocoachSetup.).*?(?=\.dmg)</string>
					<key>result_output_var_name</key>
					<string>version</string>
					<key>request_headers</key>
					<dict>
						<key>content-type</key>
						<string>application/json</string>
						<key>user-agent</key>
						<string>%USER_AGENT%</string>
					</dict>
					<key>url</key>
					<string>https://www.sportimization.com/download/</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/downloads/Sportimization-Tools - VideoCoach-*.dmg</string>
				</dict>
				<key>Processor</key>
				<string>FileFinder</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>"%found_filename%" == "%RECIPE_CACHE_DIR%/downloads/Sportimization-Tools
						- VideoCoach-%version%.dmg"</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>fail_deleter_silently</key>
					<string>True</string>
					<key>path_list</key>
					<array>
						<string>%found_filename%</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>com.github.smithjw.processors/FriendlyPathDeleter</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%-%version%.dmg</string>
					<key>url</key>
					<string>https://www.sportimization.com/svat-EXE/videocoachSetup.%version%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>io.github.hjuutilainen.VirusTotalAnalyzer/VirusTotalAnalyzer</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>NOT virus_total_analyzer_summary_result.data.ratio BEGINSWITH '0'</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%filename%/videocoach.app</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%/Applications/videocoach.app</string>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%filename%/videocanvas.app</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%/Applications/videocanvas.app</string>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%/Applications/videocoach.app</string>
					<key>requirement</key>
					<string>identifier "com.sportimization.videocoach" and anchor apple generic and
						certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate
						leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate
						leaf[subject.OU] = XT22G5GMN7</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%/Applications/videocanvas.app</string>
					<key>requirement</key>
					<string>identifier "com.sportimization.videocanvas" and anchor apple generic and
						certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate
						leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate
						leaf[subject.OU] = XT22G5GMN7</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>
						%RECIPE_CACHE_DIR%/%NAME%-%version%/Applications/videocoach.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
		</array>
	</dict>
</plist>