<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Microsoft Global Secure Access Client.</string>
	<key>Identifier</key>
	<string>com.github.moritz-Z.download.Global Secure Access Client</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Global Secure Access Client</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
				<key>url</key>
				<string>https://aka.ms/GlobalSecureAccess-macOS</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			 <key>Processor</key>
			 <string>CodeSignatureVerifier</string>
			 <key>Arguments</key>
			 <dict>
					<key>input_path</key>
					<string>%pathname%</string>
					<key>expected_authority_names</key>
					<array>
						 <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
						 <string>Developer ID Certification Authority</string>
						 <string>Apple Root CA</string>
					</array>
			 </dict>
		</dict>
	</array>
</dict>
</plist>
