<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Global Secure Access Client and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.moritz-Z.pkg.Global Secure Access Client</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Global Secure Access Client</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.moritz-Z.download.Global Secure Access Client</string>
	<key>Process</key>
	<array>
		<dict>
			 <key>Arguments</key>
			 <dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
					<key>flat_pkg_path</key>
					<string>%pathname%</string>
			 </dict>
			 <key>Processor</key>
			 <string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			 <key>Arguments</key>
			 <dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/downloads/unpack/*GlobalSecureAccessClient*.pkg</string>
			 </dict>
			 <key>Processor</key>
			 <string>FileFinder</string>
		</dict>
		<dict>
			 <key>Arguments</key>
			 <dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/payload</string>
					<key>pkg_payload_path</key>
					<string>%found_filename%/Payload</string>
			 </dict>
			 <key>Processor</key>
			 <string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/payload/Global Secure Access Client.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			 <key>Processor</key>
			 <string>PkgCopier</string>
			 <key>Arguments</key>
			 <dict>
					<key>source_pkg</key>
					<string>%pathname%</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME% - %version%.pkg</string>
			 </dict>
		</dict>
	</array>
</dict>
</plist>
